sentences = [
    [
        "сайн уу",
        "сайн байна уу",
        "өглөөний мэнд",
        "өдрийн мэнд",
        "оройн мэнд",
        "юу байна",
        "амар байна уу"
    ], [
        "хэдэн цаг болж байна",
        "цаг хэд болж байна",
        "хэд болж байна",
        "хэдэн цаг болж байна вэ",
        "цаг хэд болж байна вэ",
        "хэд болж байна вэ",
        "цаг хэлээд өгөөч",
        "өнөөдөр хэдэн бэ",
        "өнөөдөр хэдэн сарын хэдэн бэ",
        "хэдний өдөр вэ",
        "өнөөдөр хэдний өдөр вэ",
        "хэдэн сар вэ",
        "хэдэн бэ",
        "хэдэн сарын хэдэн бэ",
        "ямар гараг вэ",
        "өнөөдөр ямар гараг вэ",
        "хэд дэх өдөр вэ",
        "өнөөдөр хэд дэх өдөр вэ",
        "долоо хоногийн хэд дэх өдөр вэ"
    ],
    {
        'sentences': ["$1 хэдэн градус байх вэ", "$1 цаг агаар ямар байна", "$1 цаг агаар ямар байх вэ",
                      "$2 хэдэн градус байна", "$2 цаг агаар ямар байна", "$2 гадаа ямар байна",
                      "$2 хэдэн градус байна вэ", "$2 цаг агаар ямар байна вэ", "$2 гадаа ямар байна вэ",
                      "$2 $1 хэдэн градус байх вэ", "$2 $1 цаг агаар ямар байх вэ", "$2 цаг агаар $1 ямар байх вэ",
                      "$1 $2 цаг агаар ямар байх вэ", "$1 $2 цаг агаар ямар байх вэ"
                      ],
        'replace': {
            '$1': ['өнөөдөр', 'маргааш', 'нөгөөдөр'],
            '$2': ["Цэцэрлэгт", "Өлгийд", "Баянхонгорт", "Булганд", "Алтайд", "Чойрт", "Дарханд", "Сайншандад", "Чойбалсанд", "Мандалговьд", "Улиастайд", "Эрдэнэтэд", "Арвайхээрт", "Даланзадгадад", "Баруун-уртад", "Сүхбаатарт", "Зуунмодод", "Улаангомд", "Ховдод", "Мөрөнд", "Өндөрхаанд", "Улаанбаатарт"]
        }
    },
    [
        "гадаа хэдэн градус байна",
        "гадаа хэдэн градус байна вэ",
        "гадаа ямар байна",
        "гадаа ямар байна вэ",
        "цаг агаар ямар байна",
        "цаг агаар ямар байна вэ"
    ], {
        'sentences': [
            "$1 хэдэн төгрөг байна вэ",
            "$1 хэд байна вэ",
            "$1 хэдтэй байна вэ",
            "$1 ямар үнэтэй байна вэ",
            "$1 хэдэн төгрөг байна",
            "$1 хэд байна",
            "$1 хэдтэй байна",
            "$1 ямар үнэтэй байна",
            "$1 хэд вэ",
            "$1 хэдэн төгрөг вэ",
            "$1 хэдэн төгрөгтэй тэнцэж байна",
            "$1 хэдэн төгрөгтэй тэнцэж байна вэ"
        ],
        'replace': {
            '$1': ["Доллар", "Евро", "Иен", "Франк", "Крон", "Фунт", "Лев", "Унгарын форинт", "Рупи", "Хонконг доллар", "Египетийн фунт", "Рубль", "Тэнгэ", "Юань", "Вон", "Канад доллар", "Австрали доллар", "Чех крон", "Тайвань доллар", "Тайланд бат", "Индонез рупи", "Ринггит", "Сингапур доллар", "Дирхам", "Кувейт динар", "Шинэ Зеланд доллар", "Данийн крон", "Польшийн злот", "Украйны гривн", "Норвегийн крон", "Непалын рупи", "Өмнөд Африкийн ранд", "Туркийн лира", "Вьетнам дон"]
        }
    }, {
        'sentences': ["$1 захиалъя", "$1 идье", "$1 захиалга", "$1 аваад ир", "$1 дууд", "$1 хүргэлт", "$1 хүргээд ир"],
        'replace': {'$1': ['пицца']}
    }, {
        'sentences': ["$1", "$1 пицца", "$1 хэмжээтэй", "$1 хэмжээтэйг", "$1 хэмжээтэй пицца"],
        'replace': {'$1': ['жижиг', 'дунд', 'том']}

    }, {
        'sentences': ["$1 ширхэг", "$1 ширхгийг", "$1 ширхэг пицца"],
        'replace': {'$1': ["нэг", "хоёр", "гурван", "дөрвөн", "таван", "зургаан", "долоон", "найман", "есөн", "арван"]}
    }, ["болилоо", "зогс", "цуцал", "цуцаллаа", "дуусга", "боль"]
]

final_list = []

for sentence in sentences:
    if type(sentence) is list:
        final_list += sentence
    elif type(sentence) is dict:
        for i, s in enumerate(sentence['sentences']):
            tmp_list = []
            first_run = True
            for k, elems in sentence['replace'].items():
                for elem in elems:
                    if first_run:
                        tmp_list.append(s.replace(k, elem.lower()))
                    else:
                        for ind, tmp in enumerate(tmp_list):
                            tmp_list[ind] = tmp.replace(k, elem.lower())
                first_run = False
            final_list += tmp_list

final_set = sorted(set(final_list))
print(len(final_set))
with open('sentences.txt', 'w') as f:
    for i in list(final_set):
        f.write(i + '\n')

final_words = set()

for s in final_set:
    words = s.split(' ')
    for word in words:
        final_words.add(word)
final_words = sorted(final_words)
with open('words.txt', 'w') as f:
    for i in list(final_words):
        f.write(i + '\n')
